In [1]:
import pandas as pd
import numpy as np

In [2]:
data = np.random.randn(4,3)

In [3]:
data

array([[-0.88771122, -0.65674986, -1.33122416],
       [ 0.38069418,  1.38736329, -0.90183987],
       [ 0.48879275,  2.00798623,  1.97248646],
       [ 0.30468905, -1.74341711, -0.06367991]])

In [4]:
data_frame=pd.DataFrame(data)

In [5]:
data_frame

          0         1         2
0 -0.887711 -0.656750 -1.331224
1  0.380694  1.387363 -0.901840
2  0.488793  2.007986  1.972486
3  0.304689 -1.743417 -0.063680

In [6]:
type(data_frame)

pandas.core.frame.DataFrame

In [7]:
data_frame[0]

0   -0.887711
1    0.380694
2    0.488793
3    0.304689
Name: 0, dtype: float64

In [8]:
type(data_frame[0])

pandas.core.series.Series

In [13]:
new_df = pd.DataFrame(data,index=["Olgun","Kadir", "Gülhan","Recep"], columns=["Salary","Age","Seniority"])

In [12]:
new_df

          Salary       Age  Seniority
Olgun  -0.887711 -0.656750  -1.331224
Kadir   0.380694  1.387363  -0.901840
Gülhan  0.488793  2.007986   1.972486
Recep   0.304689 -1.743417  -0.063680

In [14]:
new_df["Age"]

Olgun    -0.656750
Kadir     1.387363
Gülhan    2.007986
Recep    -1.743417
Name: Age, dtype: float64

In [15]:
new_df['Salary']

Olgun    -0.887711
Kadir     0.380694
Gülhan    0.488793
Recep     0.304689
Name: Salary, dtype: float64

In [18]:
new_df[['Salary','Age']]

          Salary       Age
Olgun  -0.887711 -0.656750
Kadir   0.380694  1.387363
Gülhan  0.488793  2.007986
Recep   0.304689 -1.743417

In [19]:
new_df.loc['Olgun']

Salary      -0.887711
Age         -0.656750
Seniority   -1.331224
Name: Olgun, dtype: float64

In [20]:
new_df.iloc[0]

Salary      -0.887711
Age         -0.656750
Seniority   -1.331224
Name: Olgun, dtype: float64

In [21]:
new_df["Extras"]=10

In [22]:
new_df

          Salary       Age  Seniority  Extras
Olgun  -0.887711 -0.656750  -1.331224      10
Kadir   0.380694  1.387363  -0.901840      10
Gülhan  0.488793  2.007986   1.972486      10
Recep   0.304689 -1.743417  -0.063680      10

In [26]:
new_df.drop("Extras", axis=1 ,inplace=True)

In [27]:
new_df.drop("Recep", axis=0 )

          Salary       Age  Seniority
Olgun  -0.887711 -0.656750  -1.331224
Kadir   0.380694  1.387363  -0.901840
Gülhan  0.488793  2.007986   1.972486

In [28]:
new_df

          Salary       Age  Seniority
Olgun  -0.887711 -0.656750  -1.331224
Kadir   0.380694  1.387363  -0.901840
Gülhan  0.488793  2.007986   1.972486
Recep   0.304689 -1.743417  -0.063680

In [29]:
new_df.loc["Olgun"]

Salary      -0.887711
Age         -0.656750
Seniority   -1.331224
Name: Olgun, dtype: float64

In [32]:
new_df.loc["Olgun"]["Salary"]

np.float64(-0.8877112184280008)

In [66]:
new_df.iloc[0].iloc[0]

np.float64(-0.8877112184280008)

In [34]:
boolean_frame = new_df >1

In [35]:
boolean_frame

        Salary    Age  Seniority
Olgun    False  False      False
Kadir    False   True      False
Gülhan   False   True       True
Recep    False  False      False

In [36]:
new_df[boolean_frame]

        Salary       Age  Seniority
Olgun      NaN       NaN        NaN
Kadir      NaN  1.387363        NaN
Gülhan     NaN  2.007986   1.972486
Recep      NaN       NaN        NaN

In [37]:
new_df[new_df>0]

          Salary       Age  Seniority
Olgun        NaN       NaN        NaN
Kadir   0.380694  1.387363        NaN
Gülhan  0.488793  2.007986   1.972486
Recep   0.304689       NaN        NaN

In [39]:
new_df.reset_index()

    index    Salary       Age  Seniority
0   Olgun -0.887711 -0.656750  -1.331224
1   Kadir  0.380694  1.387363  -0.901840
2  Gülhan  0.488793  2.007986   1.972486
3   Recep  0.304689 -1.743417  -0.063680

In [40]:
new_indices = ["ogi","kado","ali","şükrü"]

In [41]:
new_df["NewIndex"] = new_indices

In [42]:
new_df

          Salary       Age  Seniority NewIndex
Olgun  -0.887711 -0.656750  -1.331224      ogi
Kadir   0.380694  1.387363  -0.901840     kado
Gülhan  0.488793  2.007986   1.972486      ali
Recep   0.304689 -1.743417  -0.063680    şükrü

In [43]:
new_df.set_index("NewIndex", inplace=True)

In [44]:
new_df

            Salary       Age  Seniority
NewIndex
ogi      -0.887711 -0.656750  -1.331224
kado      0.380694  1.387363  -0.901840
ali       0.488793  2.007986   1.972486
şükrü     0.304689 -1.743417  -0.063680

In [45]:
new_df.loc["ogi"]

Salary      -0.887711
Age         -0.656750
Seniority   -1.331224
Name: ogi, dtype: float64

In [46]:
first_index = ["Simpson","Simpson","Simpson","South Park", "South Park", "South Park"]

In [47]:
inner_index = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [48]:
zipped_index= list(zip(first_index,inner_index))

In [49]:
zipped_index

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [50]:
zipped_index= pd.MultiIndex.from_tuples(zipped_index)

In [51]:
zipped_index

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [53]:
sample_values = np.ones((6,2))

In [57]:
big_df = pd.DataFrame(data=sample_values,index=zipped_index,columns=["Age","Salary"])

In [58]:
big_df

                    Age  Salary
Simpson    Homer    1.0     1.0
           Bart     1.0     1.0
           Marge    1.0     1.0
South Park Cartman  1.0     1.0
           Kenny    1.0     1.0
           Kyle     1.0     1.0

In [60]:
big_df.loc["Simpson"]

       Age  Salary
Homer  1.0     1.0
Bart   1.0     1.0
Marge  1.0     1.0

In [63]:
big_df.loc['Simpson'].loc["Homer"]

Age       1.0
Salary    1.0
Name: Homer, dtype: float64

In [65]:
big_df.iloc[0].iloc[0]

np.float64(1.0)